garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.inc
// Register: I3C1CON0
#define I3C1CON0 I3C1CON0
I3C1CON0                                 equ 0083h
// bitfield definitions
I3C1CON0_IBIREQ_POSN                     equ 0000h
I3C1CON0_IBIREQ_POSITION                 equ 0000h
I3C1CON0_IBIREQ_SIZE                     equ 0001h
I3C1CON0_IBIREQ_LENGTH                   equ 0001h
I3C1CON0_IBIREQ_MASK                     equ 0001h
I3C1CON0_HJREQ_POSN                      equ 0001h
I3C1CON0_HJREQ_POSITION                  equ 0001h
I3C1CON0_HJREQ_SIZE                      equ 0001h
I3C1CON0_HJREQ_LENGTH                    equ 0001h
I3C1CON0_HJREQ_MASK                      equ 0002h
I3C1CON0_ACKP_POSN                       equ 0002h
I3C1CON0_ACKP_POSITION                   equ 0002h
I3C1CON0_ACKP_SIZE                       equ 0001h
I3C1CON0_ACKP_LENGTH                     equ 0001h
I3C1CON0_ACKP_MASK                       equ 0004h
I3C1CON0_CLRRXB_POSN                     equ 0003h
I3C1CON0_CLRRXB_POSITION                 equ 0003h
I3C1CON0_CLRRXB_SIZE                     equ 0001h
I3C1CON0_CLRRXB_LENGTH                   equ 0001h
I3C1CON0_CLRRXB_MASK                     equ 0008h
I3C1CON0_CLRTXB_POSN                     equ 0004h
I3C1CON0_CLRTXB_POSITION                 equ 0004h
I3C1CON0_CLRTXB_SIZE                     equ 0001h
I3C1CON0_CLRTXB_LENGTH                   equ 0001h
I3C1CON0_CLRTXB_MASK                     equ 0010h
I3C1CON0_RST_POSN                        equ 0005h
I3C1CON0_RST_POSITION                    equ 0005h
I3C1CON0_RST_SIZE                        equ 0001h
I3C1CON0_RST_LENGTH                      equ 0001h
I3C1CON0_RST_MASK                        equ 0020h
I3C1CON0_BTOEN_POSN                      equ 0006h
I3C1CON0_BTOEN_POSITION                  equ 0006h
I3C1CON0_BTOEN_SIZE                      equ 0001h
I3C1CON0_BTOEN_LENGTH                    equ 0001h
I3C1CON0_BTOEN_MASK                      equ 0040h
I3C1CON0_EN_POSN                         equ 0007h
I3C1CON0_EN_POSITION                     equ 0007h
I3C1CON0_EN_SIZE                         equ 0001h
I3C1CON0_EN_LENGTH                       equ 0001h
I3C1CON0_EN_MASK                         equ 0080h

// Register: I3C1CON1
#define I3C1CON1 I3C1CON1
I3C1CON1                                 equ 0084h
// bitfield definitions
I3C1CON1_ACKPOS_POSN                     equ 0000h
I3C1CON1_ACKPOS_POSITION                 equ 0000h
I3C1CON1_ACKPOS_SIZE                     equ 0001h
I3C1CON1_ACKPOS_LENGTH                   equ 0001h
I3C1CON1_ACKPOS_MASK                     equ 0001h
I3C1CON1_SASDRMD_POSN                    equ 0001h
I3C1CON1_SASDRMD_POSITION                equ 0001h
I3C1CON1_SASDRMD_SIZE                    equ 0001h
I3C1CON1_SASDRMD_LENGTH                  equ 0001h
I3C1CON1_SASDRMD_MASK                    equ 0002h
I3C1CON1_FHDRE_POSN                      equ 0002h
I3C1CON1_FHDRE_POSITION                  equ 0002h
I3C1CON1_FHDRE_SIZE                      equ 0001h
I3C1CON1_FHDRE_LENGTH                    equ 0001h
I3C1CON1_FHDRE_MASK                      equ 0004h
I3C1CON1_BERRDET_POSN                    equ 0003h
I3C1CON1_BERRDET_POSITION                equ 0003h
I3C1CON1_BERRDET_SIZE                    equ 0001h
I3C1CON1_BERRDET_LENGTH                  equ 0001h
I3C1CON1_BERRDET_MASK                    equ 0008h

// Register: I3C1RXB
#define I3C1RXB I3C1RXB
I3C1RXB                                  equ 0085h
// bitfield definitions
I3C1RXB_RXB_POSN                         equ 0000h
I3C1RXB_RXB_POSITION                     equ 0000h
I3C1RXB_RXB_SIZE                         equ 0008h
I3C1RXB_RXB_LENGTH                       equ 0008h
I3C1RXB_RXB_MASK                         equ 00FFh

// Register: I3C1TXB
#define I3C1TXB I3C1TXB
I3C1TXB                                  equ 0086h
// bitfield definitions
I3C1TXB_TXB_POSN                         equ 0000h
I3C1TXB_TXB_POSITION                     equ 0000h
I3C1TXB_TXB_SIZE                         equ 0008h
I3C1TXB_TXB_LENGTH                       equ 0008h
I3C1TXB_TXB_MASK                         equ 00FFh

// Register: I3C1STAT0
#define I3C1STAT0 I3C1STAT0
I3C1STAT0                                equ 0087h
// bitfield definitions
I3C1STAT0_RNW_POSN                       equ 0000h
I3C1STAT0_RNW_POSITION                   equ 0000h
I3C1STAT0_RNW_SIZE                       equ 0002h
I3C1STAT0_RNW_LENGTH                     equ 0002h
I3C1STAT0_RNW_MASK                       equ 0003h
I3C1STAT0_RXBF_POSN                      equ 0002h
I3C1STAT0_RXBF_POSITION                  equ 0002h
I3C1STAT0_RXBF_SIZE                      equ 0001h
I3C1STAT0_RXBF_LENGTH                    equ 0001h
I3C1STAT0_RXBF_MASK                      equ 0004h
I3C1STAT0_TXBE_POSN                      equ 0003h
I3C1STAT0_TXBE_POSITION                  equ 0003h
I3C1STAT0_TXBE_SIZE                      equ 0001h
I3C1STAT0_TXBE_LENGTH                    equ 0001h
I3C1STAT0_TXBE_MASK                      equ 0008h
I3C1STAT0_RSTDET_POSN                    equ 0004h
I3C1STAT0_RSTDET_POSITION                equ 0004h
I3C1STAT0_RSTDET_SIZE                    equ 0001h
I3C1STAT0_RSTDET_LENGTH                  equ 0001h
I3C1STAT0_RSTDET_MASK                    equ 0010h
I3C1STAT0_OPMD_POSN                      equ 0005h
I3C1STAT0_OPMD_POSITION                  equ 0005h
I3C1STAT0_OPMD_SIZE                      equ 0002h
I3C1STAT0_OPMD_LENGTH                    equ 0002h
I3C1STAT0_OPMD_MASK                      equ 0060h
I3C1STAT0_BFREE_POSN                     equ 0007h
I3C1STAT0_BFREE_POSITION                 equ 0007h
I3C1STAT0_BFREE_SIZE                     equ 0001h
I3C1STAT0_BFREE_LENGTH                   equ 0001h
I3C1STAT0_BFREE_MASK                     equ 0080h

// Register: I3C1STAT1
#define I3C1STAT1 I3C1STAT1
I3C1STAT1                                equ 0088h
// bitfield definitions
I3C1STAT1_TXFNE_POSN                     equ 0000h
I3C1STAT1_TXFNE_POSITION                 equ 0000h
I3C1STAT1_TXFNE_SIZE                     equ 0001h
I3C1STAT1_TXFNE_LENGTH                   equ 0001h
I3C1STAT1_TXFNE_MASK                     equ 0001h

// Register: I3C1BSTAT
#define I3C1BSTAT I3C1BSTAT
I3C1BSTAT                                equ 0089h
// bitfield definitions
I3C1BSTAT_TE0ERR_POSN                    equ 0000h
I3C1BSTAT_TE0ERR_POSITION                equ 0000h
I3C1BSTAT_TE0ERR_SIZE                    equ 0001h
I3C1BSTAT_TE0ERR_LENGTH                  equ 0001h
I3C1BSTAT_TE0ERR_MASK                    equ 0001h
I3C1BSTAT_TE1ERR_POSN                    equ 0001h
I3C1BSTAT_TE1ERR_POSITION                equ 0001h
I3C1BSTAT_TE1ERR_SIZE                    equ 0001h
I3C1BSTAT_TE1ERR_LENGTH                  equ 0001h
I3C1BSTAT_TE1ERR_MASK                    equ 0002h
I3C1BSTAT_TE2ERR_POSN                    equ 0002h
I3C1BSTAT_TE2ERR_POSITION                equ 0002h
I3C1BSTAT_TE2ERR_SIZE                    equ 0001h
I3C1BSTAT_TE2ERR_LENGTH                  equ 0001h
I3C1BSTAT_TE2ERR_MASK                    equ 0004h
I3C1BSTAT_TE3ERR_POSN                    equ 0003h
I3C1BSTAT_TE3ERR_POSITION                equ 0003h
I3C1BSTAT_TE3ERR_SIZE                    equ 0001h
I3C1BSTAT_TE3ERR_LENGTH                  equ 0001h
I3C1BSTAT_TE3ERR_MASK                    equ 0008h
I3C1BSTAT_TE4ERR_POSN                    equ 0004h
I3C1BSTAT_TE4ERR_POSITION                equ 0004h
I3C1BSTAT_TE4ERR_SIZE                    equ 0001h
I3C1BSTAT_TE4ERR_LENGTH                  equ 0001h
I3C1BSTAT_TE4ERR_MASK                    equ 0010h
I3C1BSTAT_TE5ERR_POSN                    equ 0005h
I3C1BSTAT_TE5ERR_POSITION                equ 0005h
I3C1BSTAT_TE5ERR_SIZE                    equ 0001h
I3C1BSTAT_TE5ERR_LENGTH                  equ 0001h
I3C1BSTAT_TE5ERR_MASK                    equ 0020h
I3C1BSTAT_TE6ERR_POSN                    equ 0006h
I3C1BSTAT_TE6ERR_POSITION                equ 0006h
I3C1BSTAT_TE6ERR_SIZE                    equ 0001h
I3C1BSTAT_TE6ERR_LENGTH                  equ 0001h
I3C1BSTAT_TE6ERR_MASK                    equ 0040h

// Register: I3C1PIR0
#define I3C1PIR0 I3C1PIR0
I3C1PIR0                                 equ 008Ah
// bitfield definitions
I3C1PIR0_SCCCIF_POSN                     equ 0000h
I3C1PIR0_SCCCIF_POSITION                 equ 0000h
I3C1PIR0_SCCCIF_SIZE                     equ 0001h
I3C1PIR0_SCCCIF_LENGTH                   equ 0001h
I3C1PIR0_SCCCIF_MASK                     equ 0001h
I3C1PIR0_BTFIF_POSN                      equ 0001h
I3C1PIR0_BTFIF_POSITION                  equ 0001h
I3C1PIR0_BTFIF_SIZE                      equ 0001h
I3C1PIR0_BTFIF_LENGTH                    equ 0001h
I3C1PIR0_BTFIF_MASK                      equ 0002h
I3C1PIR0_DADRIF_POSN                     equ 0002h
I3C1PIR0_DADRIF_POSITION                 equ 0002h
I3C1PIR0_DADRIF_SIZE                     equ 0001h
I3C1PIR0_DADRIF_LENGTH                   equ 0001h
I3C1PIR0_DADRIF_MASK                     equ 0004h
I3C1PIR0_SADRIF_POSN                     equ 0003h
I3C1PIR0_SADRIF_POSITION                 equ 0003h
I3C1PIR0_SADRIF_SIZE                     equ 0001h
I3C1PIR0_SADRIF_LENGTH                   equ 0001h
I3C1PIR0_SADRIF_MASK                     equ 0008h
I3C1PIR0_I2CACKIF_POSN                   equ 0004h
I3C1PIR0_I2CACKIF_POSITION               equ 0004h
I3C1PIR0_I2CACKIF_SIZE                   equ 0001h
I3C1PIR0_I2CACKIF_LENGTH                 equ 0001h
I3C1PIR0_I2CACKIF_MASK                   equ 0010h
I3C1PIR0_RSCIF_POSN                      equ 0005h
I3C1PIR0_RSCIF_POSITION                  equ 0005h
I3C1PIR0_RSCIF_SIZE                      equ 0001h
I3C1PIR0_RSCIF_LENGTH                    equ 0001h
I3C1PIR0_RSCIF_MASK                      equ 0020h
I3C1PIR0_PCIF_POSN                       equ 0006h
I3C1PIR0_PCIF_POSITION                   equ 0006h
I3C1PIR0_PCIF_SIZE                       equ 0001h
I3C1PIR0_PCIF_LENGTH                     equ 0001h
I3C1PIR0_PCIF_MASK                       equ 0040h
I3C1PIR0_SCIF_POSN                       equ 0007h
I3C1PIR0_SCIF_POSITION                   equ 0007h
I3C1PIR0_SCIF_SIZE                       equ 0001h
I3C1PIR0_SCIF_LENGTH                     equ 0001h
I3C1PIR0_SCIF_MASK                       equ 0080h

