garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.inc
// Register: I3C1MRTL
#define I3C1MRTL I3C1MRTL
I3C1MRTL                                 equ 00AEh
// bitfield definitions
I3C1MRTL_MRTL_POSN                       equ 0000h
I3C1MRTL_MRTL_POSITION                   equ 0000h
I3C1MRTL_MRTL_SIZE                       equ 0008h
I3C1MRTL_MRTL_LENGTH                     equ 0008h
I3C1MRTL_MRTL_MASK                       equ 00FFh

// Register: I3C1MRTH
#define I3C1MRTH I3C1MRTH
I3C1MRTH                                 equ 00AFh
// bitfield definitions
I3C1MRTH_MRTH_POSN                       equ 0000h
I3C1MRTH_MRTH_POSITION                   equ 0000h
I3C1MRTH_MRTH_SIZE                       equ 0008h
I3C1MRTH_MRTH_LENGTH                     equ 0008h
I3C1MRTH_MRTH_MASK                       equ 00FFh

// Register: I3C1MRTU
#define I3C1MRTU I3C1MRTU
I3C1MRTU                                 equ 00B0h
// bitfield definitions
I3C1MRTU_MRTU_POSN                       equ 0000h
I3C1MRTU_MRTU_POSITION                   equ 0000h
I3C1MRTU_MRTU_SIZE                       equ 0008h
I3C1MRTU_MRTU_LENGTH                     equ 0008h
I3C1MRTU_MRTU_MASK                       equ 00FFh

// Register: I3C1RSTACT
#define I3C1RSTACT I3C1RSTACT
I3C1RSTACT                               equ 00B1h
// bitfield definitions
I3C1RSTACT_RSTACT_POSN                   equ 0000h
I3C1RSTACT_RSTACT_POSITION               equ 0000h
I3C1RSTACT_RSTACT_SIZE                   equ 0008h
I3C1RSTACT_RSTACT_LENGTH                 equ 0008h
I3C1RSTACT_RSTACT_MASK                   equ 00FFh

// Register: I3C1BUSCXT
#define I3C1BUSCXT I3C1BUSCXT
I3C1BUSCXT                               equ 00B2h
// bitfield definitions
I3C1BUSCXT_BUSCXT_POSN                   equ 0000h
I3C1BUSCXT_BUSCXT_POSITION               equ 0000h
I3C1BUSCXT_BUSCXT_SIZE                   equ 0008h
I3C1BUSCXT_BUSCXT_LENGTH                 equ 0008h
I3C1BUSCXT_BUSCXT_MASK                   equ 00FFh

// Register: I3C1CCC
#define I3C1CCC I3C1CCC
I3C1CCC                                  equ 00B3h
// bitfield definitions
I3C1CCC_CCC_POSN                         equ 0000h
I3C1CCC_CCC_POSITION                     equ 0000h
I3C1CCC_CCC_SIZE                         equ 0008h
I3C1CCC_CCC_LENGTH                       equ 0008h
I3C1CCC_CCC_MASK                         equ 00FFh

// Register: I3C1I2CCON
#define I3C1I2CCON I3C1I2CCON
I3C1I2CCON                               equ 00B4h
// bitfield definitions
I3C1I2CCON_SDAHT_POSN                    equ 0000h
I3C1I2CCON_SDAHT_POSITION                equ 0000h
I3C1I2CCON_SDAHT_SIZE                    equ 0002h
I3C1I2CCON_SDAHT_LENGTH                  equ 0002h
I3C1I2CCON_SDAHT_MASK                    equ 0003h
I3C1I2CCON_FLTEN_POSN                    equ 0002h
I3C1I2CCON_FLTEN_POSITION                equ 0002h
I3C1I2CCON_FLTEN_SIZE                    equ 0001h
I3C1I2CCON_FLTEN_LENGTH                  equ 0001h
I3C1I2CCON_FLTEN_MASK                    equ 0004h

// Register: I3C1CLK
#define I3C1CLK I3C1CLK
I3C1CLK                                  equ 00B5h
// bitfield definitions
I3C1CLK_CLK_POSN                         equ 0000h
I3C1CLK_CLK_POSITION                     equ 0000h
I3C1CLK_CLK_SIZE                         equ 0008h
I3C1CLK_CLK_LENGTH                       equ 0008h
I3C1CLK_CLK_MASK                         equ 00FFh
I3C1CLK_CLK0_POSN                        equ 0000h
I3C1CLK_CLK0_POSITION                    equ 0000h
I3C1CLK_CLK0_SIZE                        equ 0001h
I3C1CLK_CLK0_LENGTH                      equ 0001h
I3C1CLK_CLK0_MASK                        equ 0001h
I3C1CLK_CLK1_POSN                        equ 0001h
I3C1CLK_CLK1_POSITION                    equ 0001h
I3C1CLK_CLK1_SIZE                        equ 0001h
I3C1CLK_CLK1_LENGTH                      equ 0001h
I3C1CLK_CLK1_MASK                        equ 0002h
I3C1CLK_CLK2_POSN                        equ 0002h
I3C1CLK_CLK2_POSITION                    equ 0002h
I3C1CLK_CLK2_SIZE                        equ 0001h
I3C1CLK_CLK2_LENGTH                      equ 0001h
I3C1CLK_CLK2_MASK                        equ 0004h
I3C1CLK_CLK3_POSN                        equ 0003h
I3C1CLK_CLK3_POSITION                    equ 0003h
I3C1CLK_CLK3_SIZE                        equ 0001h
I3C1CLK_CLK3_LENGTH                      equ 0001h
I3C1CLK_CLK3_MASK                        equ 0008h

// Register: I3C2CON0
#define I3C2CON0 I3C2CON0
I3C2CON0                                 equ 00B6h
// bitfield definitions
I3C2CON0_IBIREQ_POSN                     equ 0000h
I3C2CON0_IBIREQ_POSITION                 equ 0000h
I3C2CON0_IBIREQ_SIZE                     equ 0001h
I3C2CON0_IBIREQ_LENGTH                   equ 0001h
I3C2CON0_IBIREQ_MASK                     equ 0001h
I3C2CON0_HJREQ_POSN                      equ 0001h
I3C2CON0_HJREQ_POSITION                  equ 0001h
I3C2CON0_HJREQ_SIZE                      equ 0001h
I3C2CON0_HJREQ_LENGTH                    equ 0001h
I3C2CON0_HJREQ_MASK                      equ 0002h
I3C2CON0_ACKP_POSN                       equ 0002h
I3C2CON0_ACKP_POSITION                   equ 0002h
I3C2CON0_ACKP_SIZE                       equ 0001h
I3C2CON0_ACKP_LENGTH                     equ 0001h
I3C2CON0_ACKP_MASK                       equ 0004h
I3C2CON0_CLRRXB_POSN                     equ 0003h
I3C2CON0_CLRRXB_POSITION                 equ 0003h
I3C2CON0_CLRRXB_SIZE                     equ 0001h
I3C2CON0_CLRRXB_LENGTH                   equ 0001h
I3C2CON0_CLRRXB_MASK                     equ 0008h
I3C2CON0_CLRTXB_POSN                     equ 0004h
I3C2CON0_CLRTXB_POSITION                 equ 0004h
I3C2CON0_CLRTXB_SIZE                     equ 0001h
I3C2CON0_CLRTXB_LENGTH                   equ 0001h
I3C2CON0_CLRTXB_MASK                     equ 0010h
I3C2CON0_RST_POSN                        equ 0005h
I3C2CON0_RST_POSITION                    equ 0005h
I3C2CON0_RST_SIZE                        equ 0001h
I3C2CON0_RST_LENGTH                      equ 0001h
I3C2CON0_RST_MASK                        equ 0020h
I3C2CON0_BTOEN_POSN                      equ 0006h
I3C2CON0_BTOEN_POSITION                  equ 0006h
I3C2CON0_BTOEN_SIZE                      equ 0001h
I3C2CON0_BTOEN_LENGTH                    equ 0001h
I3C2CON0_BTOEN_MASK                      equ 0040h
I3C2CON0_EN_POSN                         equ 0007h
I3C2CON0_EN_POSITION                     equ 0007h
I3C2CON0_EN_SIZE                         equ 0001h
I3C2CON0_EN_LENGTH                       equ 0001h
I3C2CON0_EN_MASK                         equ 0080h

// Register: I3C2CON1
#define I3C2CON1 I3C2CON1
I3C2CON1                                 equ 00B7h
// bitfield definitions
I3C2CON1_ACKPOS_POSN                     equ 0000h
I3C2CON1_ACKPOS_POSITION                 equ 0000h
I3C2CON1_ACKPOS_SIZE                     equ 0001h
I3C2CON1_ACKPOS_LENGTH                   equ 0001h
I3C2CON1_ACKPOS_MASK                     equ 0001h
I3C2CON1_SASDRMD_POSN                    equ 0001h
I3C2CON1_SASDRMD_POSITION                equ 0001h
I3C2CON1_SASDRMD_SIZE                    equ 0001h
I3C2CON1_SASDRMD_LENGTH                  equ 0001h
I3C2CON1_SASDRMD_MASK                    equ 0002h
I3C2CON1_FHDRE_POSN                      equ 0002h
I3C2CON1_FHDRE_POSITION                  equ 0002h
I3C2CON1_FHDRE_SIZE                      equ 0001h
I3C2CON1_FHDRE_LENGTH                    equ 0001h
I3C2CON1_FHDRE_MASK                      equ 0004h
I3C2CON1_BERRDET_POSN                    equ 0003h
I3C2CON1_BERRDET_POSITION                equ 0003h
I3C2CON1_BERRDET_SIZE                    equ 0001h
I3C2CON1_BERRDET_LENGTH                  equ 0001h
I3C2CON1_BERRDET_MASK                    equ 0008h

// Register: I3C2RXB
#define I3C2RXB I3C2RXB
I3C2RXB                                  equ 00B8h
// bitfield definitions
I3C2RXB_RXB_POSN                         equ 0000h
I3C2RXB_RXB_POSITION                     equ 0000h
I3C2RXB_RXB_SIZE                         equ 0008h
I3C2RXB_RXB_LENGTH                       equ 0008h
I3C2RXB_RXB_MASK                         equ 00FFh

