garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.inc
// Register: I3C2PID4
#define I3C2PID4 I3C2PID4
I3C2PID4                                 equ 00D9h
// bitfield definitions
I3C2PID4_PID32_POSN                      equ 0000h
I3C2PID4_PID32_POSITION                  equ 0000h
I3C2PID4_PID32_SIZE                      equ 0001h
I3C2PID4_PID32_LENGTH                    equ 0001h
I3C2PID4_PID32_MASK                      equ 0001h
I3C2PID4_PID33_POSN                      equ 0001h
I3C2PID4_PID33_POSITION                  equ 0001h
I3C2PID4_PID33_SIZE                      equ 0001h
I3C2PID4_PID33_LENGTH                    equ 0001h
I3C2PID4_PID33_MASK                      equ 0002h
I3C2PID4_PID34_POSN                      equ 0002h
I3C2PID4_PID34_POSITION                  equ 0002h
I3C2PID4_PID34_SIZE                      equ 0001h
I3C2PID4_PID34_LENGTH                    equ 0001h
I3C2PID4_PID34_MASK                      equ 0004h
I3C2PID4_PID35_POSN                      equ 0003h
I3C2PID4_PID35_POSITION                  equ 0003h
I3C2PID4_PID35_SIZE                      equ 0001h
I3C2PID4_PID35_LENGTH                    equ 0001h
I3C2PID4_PID35_MASK                      equ 0008h
I3C2PID4_PID36_POSN                      equ 0004h
I3C2PID4_PID36_POSITION                  equ 0004h
I3C2PID4_PID36_SIZE                      equ 0001h
I3C2PID4_PID36_LENGTH                    equ 0001h
I3C2PID4_PID36_MASK                      equ 0010h
I3C2PID4_PID37_POSN                      equ 0005h
I3C2PID4_PID37_POSITION                  equ 0005h
I3C2PID4_PID37_SIZE                      equ 0001h
I3C2PID4_PID37_LENGTH                    equ 0001h
I3C2PID4_PID37_MASK                      equ 0020h
I3C2PID4_PID38_POSN                      equ 0006h
I3C2PID4_PID38_POSITION                  equ 0006h
I3C2PID4_PID38_SIZE                      equ 0001h
I3C2PID4_PID38_LENGTH                    equ 0001h
I3C2PID4_PID38_MASK                      equ 0040h
I3C2PID4_PID39_POSN                      equ 0007h
I3C2PID4_PID39_POSITION                  equ 0007h
I3C2PID4_PID39_SIZE                      equ 0001h
I3C2PID4_PID39_LENGTH                    equ 0001h
I3C2PID4_PID39_MASK                      equ 0080h
I3C2PID4_PID_39_33_POSN                  equ 0001h
I3C2PID4_PID_39_33_POSITION              equ 0001h
I3C2PID4_PID_39_33_SIZE                  equ 0007h
I3C2PID4_PID_39_33_LENGTH                equ 0007h
I3C2PID4_PID_39_33_MASK                  equ 00FEh

// Register: I3C2PID5
#define I3C2PID5 I3C2PID5
I3C2PID5                                 equ 00DAh
// bitfield definitions
I3C2PID5_PID40_POSN                      equ 0000h
I3C2PID5_PID40_POSITION                  equ 0000h
I3C2PID5_PID40_SIZE                      equ 0001h
I3C2PID5_PID40_LENGTH                    equ 0001h
I3C2PID5_PID40_MASK                      equ 0001h
I3C2PID5_PID41_POSN                      equ 0001h
I3C2PID5_PID41_POSITION                  equ 0001h
I3C2PID5_PID41_SIZE                      equ 0001h
I3C2PID5_PID41_LENGTH                    equ 0001h
I3C2PID5_PID41_MASK                      equ 0002h
I3C2PID5_PID42_POSN                      equ 0002h
I3C2PID5_PID42_POSITION                  equ 0002h
I3C2PID5_PID42_SIZE                      equ 0001h
I3C2PID5_PID42_LENGTH                    equ 0001h
I3C2PID5_PID42_MASK                      equ 0004h
I3C2PID5_PID43_POSN                      equ 0003h
I3C2PID5_PID43_POSITION                  equ 0003h
I3C2PID5_PID43_SIZE                      equ 0001h
I3C2PID5_PID43_LENGTH                    equ 0001h
I3C2PID5_PID43_MASK                      equ 0008h
I3C2PID5_PID44_POSN                      equ 0004h
I3C2PID5_PID44_POSITION                  equ 0004h
I3C2PID5_PID44_SIZE                      equ 0001h
I3C2PID5_PID44_LENGTH                    equ 0001h
I3C2PID5_PID44_MASK                      equ 0010h
I3C2PID5_PID45_POSN                      equ 0005h
I3C2PID5_PID45_POSITION                  equ 0005h
I3C2PID5_PID45_SIZE                      equ 0001h
I3C2PID5_PID45_LENGTH                    equ 0001h
I3C2PID5_PID45_MASK                      equ 0020h
I3C2PID5_PID46_POSN                      equ 0006h
I3C2PID5_PID46_POSITION                  equ 0006h
I3C2PID5_PID46_SIZE                      equ 0001h
I3C2PID5_PID46_LENGTH                    equ 0001h
I3C2PID5_PID46_MASK                      equ 0040h
I3C2PID5_PID47_POSN                      equ 0007h
I3C2PID5_PID47_POSITION                  equ 0007h
I3C2PID5_PID47_SIZE                      equ 0001h
I3C2PID5_PID47_LENGTH                    equ 0001h
I3C2PID5_PID47_MASK                      equ 0080h
I3C2PID5_PID_47_40_POSN                  equ 0000h
I3C2PID5_PID_47_40_POSITION              equ 0000h
I3C2PID5_PID_47_40_SIZE                  equ 0008h
I3C2PID5_PID_47_40_LENGTH                equ 0008h
I3C2PID5_PID_47_40_MASK                  equ 00FFh

// Register: I3C2BCR
#define I3C2BCR I3C2BCR
I3C2BCR                                  equ 00DBh
// bitfield definitions
I3C2BCR_BCR0_POSN                        equ 0000h
I3C2BCR_BCR0_POSITION                    equ 0000h
I3C2BCR_BCR0_SIZE                        equ 0001h
I3C2BCR_BCR0_LENGTH                      equ 0001h
I3C2BCR_BCR0_MASK                        equ 0001h
I3C2BCR_BCR1_POSN                        equ 0001h
I3C2BCR_BCR1_POSITION                    equ 0001h
I3C2BCR_BCR1_SIZE                        equ 0001h
I3C2BCR_BCR1_LENGTH                      equ 0001h
I3C2BCR_BCR1_MASK                        equ 0002h
I3C2BCR_BCR2_POSN                        equ 0002h
I3C2BCR_BCR2_POSITION                    equ 0002h
I3C2BCR_BCR2_SIZE                        equ 0001h
I3C2BCR_BCR2_LENGTH                      equ 0001h
I3C2BCR_BCR2_MASK                        equ 0004h
I3C2BCR_BCR3_POSN                        equ 0003h
I3C2BCR_BCR3_POSITION                    equ 0003h
I3C2BCR_BCR3_SIZE                        equ 0001h
I3C2BCR_BCR3_LENGTH                      equ 0001h
I3C2BCR_BCR3_MASK                        equ 0008h
I3C2BCR_BCR4_POSN                        equ 0004h
I3C2BCR_BCR4_POSITION                    equ 0004h
I3C2BCR_BCR4_SIZE                        equ 0001h
I3C2BCR_BCR4_LENGTH                      equ 0001h
I3C2BCR_BCR4_MASK                        equ 0010h
I3C2BCR_BCR5_POSN                        equ 0005h
I3C2BCR_BCR5_POSITION                    equ 0005h
I3C2BCR_BCR5_SIZE                        equ 0001h
I3C2BCR_BCR5_LENGTH                      equ 0001h
I3C2BCR_BCR5_MASK                        equ 0020h
I3C2BCR_BCR6_POSN                        equ 0006h
I3C2BCR_BCR6_POSITION                    equ 0006h
I3C2BCR_BCR6_SIZE                        equ 0001h
I3C2BCR_BCR6_LENGTH                      equ 0001h
I3C2BCR_BCR6_MASK                        equ 0040h
I3C2BCR_BCR7_POSN                        equ 0007h
I3C2BCR_BCR7_POSITION                    equ 0007h
I3C2BCR_BCR7_SIZE                        equ 0001h
I3C2BCR_BCR7_LENGTH                      equ 0001h
I3C2BCR_BCR7_MASK                        equ 0080h
I3C2BCR_BCR_7_6_POSN                     equ 0006h
I3C2BCR_BCR_7_6_POSITION                 equ 0006h
I3C2BCR_BCR_7_6_SIZE                     equ 0002h
I3C2BCR_BCR_7_6_LENGTH                   equ 0002h
I3C2BCR_BCR_7_6_MASK                     equ 00C0h

// Register: I3C2DCR
#define I3C2DCR I3C2DCR
I3C2DCR                                  equ 00DCh
// bitfield definitions
I3C2DCR_DCR_POSN                         equ 0000h
I3C2DCR_DCR_POSITION                     equ 0000h
I3C2DCR_DCR_SIZE                         equ 0008h
I3C2DCR_DCR_LENGTH                       equ 0008h
I3C2DCR_DCR_MASK                         equ 00FFh

// Register: I3C2DSTAT0
#define I3C2DSTAT0 I3C2DSTAT0
I3C2DSTAT0                               equ 00DDh
// bitfield definitions
I3C2DSTAT0_INTPEND_POSN                  equ 0000h
I3C2DSTAT0_INTPEND_POSITION              equ 0000h
I3C2DSTAT0_INTPEND_SIZE                  equ 0004h
I3C2DSTAT0_INTPEND_LENGTH                equ 0004h
I3C2DSTAT0_INTPEND_MASK                  equ 000Fh
I3C2DSTAT0_PERR_POSN                     equ 0005h
I3C2DSTAT0_PERR_POSITION                 equ 0005h
I3C2DSTAT0_PERR_SIZE                     equ 0001h
I3C2DSTAT0_PERR_LENGTH                   equ 0001h
I3C2DSTAT0_PERR_MASK                     equ 0020h
I3C2DSTAT0_ACTMODE_POSN                  equ 0006h
I3C2DSTAT0_ACTMODE_POSITION              equ 0006h
I3C2DSTAT0_ACTMODE_SIZE                  equ 0002h
I3C2DSTAT0_ACTMODE_LENGTH                equ 0002h
I3C2DSTAT0_ACTMODE_MASK                  equ 00C0h
I3C2DSTAT0_INPEND0_POSN                  equ 0000h
I3C2DSTAT0_INPEND0_POSITION              equ 0000h
I3C2DSTAT0_INPEND0_SIZE                  equ 0001h
I3C2DSTAT0_INPEND0_LENGTH                equ 0001h
I3C2DSTAT0_INPEND0_MASK                  equ 0001h
I3C2DSTAT0_INTPEND1_POSN                 equ 0001h
I3C2DSTAT0_INTPEND1_POSITION             equ 0001h
I3C2DSTAT0_INTPEND1_SIZE                 equ 0001h
I3C2DSTAT0_INTPEND1_LENGTH               equ 0001h
I3C2DSTAT0_INTPEND1_MASK                 equ 0002h
I3C2DSTAT0_INTPEND2_POSN                 equ 0002h
I3C2DSTAT0_INTPEND2_POSITION             equ 0002h
I3C2DSTAT0_INTPEND2_SIZE                 equ 0001h
I3C2DSTAT0_INTPEND2_LENGTH               equ 0001h
I3C2DSTAT0_INTPEND2_MASK                 equ 0004h
I3C2DSTAT0_INTPEND3_POSN                 equ 0003h
I3C2DSTAT0_INTPEND3_POSITION             equ 0003h
I3C2DSTAT0_INTPEND3_SIZE                 equ 0001h
I3C2DSTAT0_INTPEND3_LENGTH               equ 0001h
I3C2DSTAT0_INTPEND3_MASK                 equ 0008h
I3C2DSTAT0_ACTMODE0_POSN                 equ 0006h
I3C2DSTAT0_ACTMODE0_POSITION             equ 0006h
I3C2DSTAT0_ACTMODE0_SIZE                 equ 0001h
I3C2DSTAT0_ACTMODE0_LENGTH               equ 0001h
I3C2DSTAT0_ACTMODE0_MASK                 equ 0040h
I3C2DSTAT0_ACTMODE1_POSN                 equ 0007h
I3C2DSTAT0_ACTMODE1_POSITION             equ 0007h
I3C2DSTAT0_ACTMODE1_SIZE                 equ 0001h
I3C2DSTAT0_ACTMODE1_LENGTH               equ 0001h
I3C2DSTAT0_ACTMODE1_MASK                 equ 0080h

// Register: I3C2DSTAT1
#define I3C2DSTAT1 I3C2DSTAT1
I3C2DSTAT1                               equ 00DEh
// bitfield definitions
I3C2DSTAT1_VRSV_POSN                     equ 0000h
I3C2DSTAT1_VRSV_POSITION                 equ 0000h
I3C2DSTAT1_VRSV_SIZE                     equ 0008h
I3C2DSTAT1_VRSV_LENGTH                   equ 0008h
I3C2DSTAT1_VRSV_MASK                     equ 00FFh
I3C2DSTAT1_VRSV0_POSN                    equ 0000h
I3C2DSTAT1_VRSV0_POSITION                equ 0000h
I3C2DSTAT1_VRSV0_SIZE                    equ 0001h
I3C2DSTAT1_VRSV0_LENGTH                  equ 0001h
I3C2DSTAT1_VRSV0_MASK                    equ 0001h
I3C2DSTAT1_VRSV1_POSN                    equ 0001h
I3C2DSTAT1_VRSV1_POSITION                equ 0001h
I3C2DSTAT1_VRSV1_SIZE                    equ 0001h
I3C2DSTAT1_VRSV1_LENGTH                  equ 0001h
I3C2DSTAT1_VRSV1_MASK                    equ 0002h
I3C2DSTAT1_VRSV2_POSN                    equ 0002h
I3C2DSTAT1_VRSV2_POSITION                equ 0002h
I3C2DSTAT1_VRSV2_SIZE                    equ 0001h
I3C2DSTAT1_VRSV2_LENGTH                  equ 0001h
I3C2DSTAT1_VRSV2_MASK                    equ 0004h
I3C2DSTAT1_VRSV3_POSN                    equ 0003h
I3C2DSTAT1_VRSV3_POSITION                equ 0003h
I3C2DSTAT1_VRSV3_SIZE                    equ 0001h
I3C2DSTAT1_VRSV3_LENGTH                  equ 0001h
I3C2DSTAT1_VRSV3_MASK                    equ 0008h
I3C2DSTAT1_VRSV4_POSN                    equ 0004h
I3C2DSTAT1_VRSV4_POSITION                equ 0004h
I3C2DSTAT1_VRSV4_SIZE                    equ 0001h
I3C2DSTAT1_VRSV4_LENGTH                  equ 0001h
I3C2DSTAT1_VRSV4_MASK                    equ 0010h
I3C2DSTAT1_VRSV5_POSN                    equ 0005h
I3C2DSTAT1_VRSV5_POSITION                equ 0005h
I3C2DSTAT1_VRSV5_SIZE                    equ 0001h
I3C2DSTAT1_VRSV5_LENGTH                  equ 0001h
I3C2DSTAT1_VRSV5_MASK                    equ 0020h
I3C2DSTAT1_VRSV6_POSN                    equ 0006h
I3C2DSTAT1_VRSV6_POSITION                equ 0006h
I3C2DSTAT1_VRSV6_SIZE                    equ 0001h
I3C2DSTAT1_VRSV6_LENGTH                  equ 0001h
I3C2DSTAT1_VRSV6_MASK                    equ 0040h
I3C2DSTAT1_VRSV7_POSN                    equ 0007h
I3C2DSTAT1_VRSV7_POSITION                equ 0007h
I3C2DSTAT1_VRSV7_SIZE                    equ 0001h
I3C2DSTAT1_VRSV7_LENGTH                  equ 0001h
I3C2DSTAT1_VRSV7_MASK                    equ 0080h

// Register: I3C2MWS
#define I3C2MWS I3C2MWS
I3C2MWS                                  equ 00DFh
// bitfield definitions
I3C2MWS_MWS0_POSN                        equ 0000h
I3C2MWS_MWS0_POSITION                    equ 0000h
I3C2MWS_MWS0_SIZE                        equ 0001h
I3C2MWS_MWS0_LENGTH                      equ 0001h
I3C2MWS_MWS0_MASK                        equ 0001h
I3C2MWS_MWS1_POSN                        equ 0001h
I3C2MWS_MWS1_POSITION                    equ 0001h
I3C2MWS_MWS1_SIZE                        equ 0001h
I3C2MWS_MWS1_LENGTH                      equ 0001h
I3C2MWS_MWS1_MASK                        equ 0002h
I3C2MWS_MWS2_POSN                        equ 0002h
I3C2MWS_MWS2_POSITION                    equ 0002h
I3C2MWS_MWS2_SIZE                        equ 0001h
I3C2MWS_MWS2_LENGTH                      equ 0001h
I3C2MWS_MWS2_MASK                        equ 0004h
I3C2MWS_MWS3_POSN                        equ 0003h
I3C2MWS_MWS3_POSITION                    equ 0003h
I3C2MWS_MWS3_SIZE                        equ 0001h
I3C2MWS_MWS3_LENGTH                      equ 0001h
I3C2MWS_MWS3_MASK                        equ 0008h
I3C2MWS_MWS4_POSN                        equ 0004h
I3C2MWS_MWS4_POSITION                    equ 0004h
I3C2MWS_MWS4_SIZE                        equ 0001h
I3C2MWS_MWS4_LENGTH                      equ 0001h
I3C2MWS_MWS4_MASK                        equ 0010h
I3C2MWS_MWS5_POSN                        equ 0005h
I3C2MWS_MWS5_POSITION                    equ 0005h
I3C2MWS_MWS5_SIZE                        equ 0001h
I3C2MWS_MWS5_LENGTH                      equ 0001h
I3C2MWS_MWS5_MASK                        equ 0020h
I3C2MWS_MWS6_POSN                        equ 0006h
I3C2MWS_MWS6_POSITION                    equ 0006h
I3C2MWS_MWS6_SIZE                        equ 0001h
I3C2MWS_MWS6_LENGTH                      equ 0001h
I3C2MWS_MWS6_MASK                        equ 0040h
I3C2MWS_MWS7_POSN                        equ 0007h
I3C2MWS_MWS7_POSITION                    equ 0007h
I3C2MWS_MWS7_SIZE                        equ 0001h
I3C2MWS_MWS7_LENGTH                      equ 0001h
I3C2MWS_MWS7_MASK                        equ 0080h
I3C2MWS_MWS_2_0_POSN                     equ 0000h
I3C2MWS_MWS_2_0_POSITION                 equ 0000h
I3C2MWS_MWS_2_0_SIZE                     equ 0003h
I3C2MWS_MWS_2_0_LENGTH                   equ 0003h
I3C2MWS_MWS_2_0_MASK                     equ 0007h
I3C2MWS_MWS_7_4_POSN                     equ 0004h
I3C2MWS_MWS_7_4_POSITION                 equ 0004h
I3C2MWS_MWS_7_4_SIZE                     equ 0004h
I3C2MWS_MWS_7_4_LENGTH                   equ 0004h
I3C2MWS_MWS_7_4_MASK                     equ 00F0h

// Register: I3C2MRS
#define I3C2MRS I3C2MRS
I3C2MRS                                  equ 00E0h
// bitfield definitions
I3C2MRS_MRS0_POSN                        equ 0000h
I3C2MRS_MRS0_POSITION                    equ 0000h
I3C2MRS_MRS0_SIZE                        equ 0001h
I3C2MRS_MRS0_LENGTH                      equ 0001h
I3C2MRS_MRS0_MASK                        equ 0001h
I3C2MRS_MRS1_POSN                        equ 0001h
I3C2MRS_MRS1_POSITION                    equ 0001h
I3C2MRS_MRS1_SIZE                        equ 0001h
I3C2MRS_MRS1_LENGTH                      equ 0001h
I3C2MRS_MRS1_MASK                        equ 0002h
I3C2MRS_MRS2_POSN                        equ 0002h
I3C2MRS_MRS2_POSITION                    equ 0002h
I3C2MRS_MRS2_SIZE                        equ 0001h
I3C2MRS_MRS2_LENGTH                      equ 0001h
I3C2MRS_MRS2_MASK                        equ 0004h
I3C2MRS_MRS3_POSN                        equ 0003h
I3C2MRS_MRS3_POSITION                    equ 0003h
I3C2MRS_MRS3_SIZE                        equ 0001h
I3C2MRS_MRS3_LENGTH                      equ 0001h
I3C2MRS_MRS3_MASK                        equ 0008h
I3C2MRS_MRS4_POSN                        equ 0004h
I3C2MRS_MRS4_POSITION                    equ 0004h
I3C2MRS_MRS4_SIZE                        equ 0001h
I3C2MRS_MRS4_LENGTH                      equ 0001h
I3C2MRS_MRS4_MASK                        equ 0010h
I3C2MRS_MRS5_POSN                        equ 0005h
I3C2MRS_MRS5_POSITION                    equ 0005h
I3C2MRS_MRS5_SIZE                        equ 0001h
I3C2MRS_MRS5_LENGTH                      equ 0001h
I3C2MRS_MRS5_MASK                        equ 0020h
I3C2MRS_MRS6_POSN                        equ 0006h
I3C2MRS_MRS6_POSITION                    equ 0006h
I3C2MRS_MRS6_SIZE                        equ 0001h
I3C2MRS_MRS6_LENGTH                      equ 0001h
I3C2MRS_MRS6_MASK                        equ 0040h
I3C2MRS_MRS7_POSN                        equ 0007h
I3C2MRS_MRS7_POSITION                    equ 0007h
I3C2MRS_MRS7_SIZE                        equ 0001h
I3C2MRS_MRS7_LENGTH                      equ 0001h
I3C2MRS_MRS7_MASK                        equ 0080h
I3C2MRS_MRS_2_0_POSN                     equ 0000h
I3C2MRS_MRS_2_0_POSITION                 equ 0000h
I3C2MRS_MRS_2_0_SIZE                     equ 0003h
I3C2MRS_MRS_2_0_LENGTH                   equ 0003h
I3C2MRS_MRS_2_0_MASK                     equ 0007h
I3C2MRS_MRS_5_3_POSN                     equ 0003h
I3C2MRS_MRS_5_3_POSITION                 equ 0003h
I3C2MRS_MRS_5_3_SIZE                     equ 0003h
I3C2MRS_MRS_5_3_LENGTH                   equ 0003h
I3C2MRS_MRS_5_3_MASK                     equ 0038h

