garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.inc
// Register: SPI1INTF
#define SPI1INTF SPI1INTF
SPI1INTF                                 equ 01E1h
// bitfield definitions
SPI1INTF_TXUIF_POSN                      equ 0001h
SPI1INTF_TXUIF_POSITION                  equ 0001h
SPI1INTF_TXUIF_SIZE                      equ 0001h
SPI1INTF_TXUIF_LENGTH                    equ 0001h
SPI1INTF_TXUIF_MASK                      equ 0002h
SPI1INTF_RXOIF_POSN                      equ 0002h
SPI1INTF_RXOIF_POSITION                  equ 0002h
SPI1INTF_RXOIF_SIZE                      equ 0001h
SPI1INTF_RXOIF_LENGTH                    equ 0001h
SPI1INTF_RXOIF_MASK                      equ 0004h
SPI1INTF_EOSIF_POSN                      equ 0004h
SPI1INTF_EOSIF_POSITION                  equ 0004h
SPI1INTF_EOSIF_SIZE                      equ 0001h
SPI1INTF_EOSIF_LENGTH                    equ 0001h
SPI1INTF_EOSIF_MASK                      equ 0010h
SPI1INTF_SOSIF_POSN                      equ 0005h
SPI1INTF_SOSIF_POSITION                  equ 0005h
SPI1INTF_SOSIF_SIZE                      equ 0001h
SPI1INTF_SOSIF_LENGTH                    equ 0001h
SPI1INTF_SOSIF_MASK                      equ 0020h
SPI1INTF_TCZIF_POSN                      equ 0006h
SPI1INTF_TCZIF_POSITION                  equ 0006h
SPI1INTF_TCZIF_SIZE                      equ 0001h
SPI1INTF_TCZIF_LENGTH                    equ 0001h
SPI1INTF_TCZIF_MASK                      equ 0040h
SPI1INTF_SRMTIF_POSN                     equ 0007h
SPI1INTF_SRMTIF_POSITION                 equ 0007h
SPI1INTF_SRMTIF_SIZE                     equ 0001h
SPI1INTF_SRMTIF_LENGTH                   equ 0001h
SPI1INTF_SRMTIF_MASK                     equ 0080h
SPI1INTF_SPI1TXUIF_POSN                  equ 0001h
SPI1INTF_SPI1TXUIF_POSITION              equ 0001h
SPI1INTF_SPI1TXUIF_SIZE                  equ 0001h
SPI1INTF_SPI1TXUIF_LENGTH                equ 0001h
SPI1INTF_SPI1TXUIF_MASK                  equ 0002h
SPI1INTF_SPI1RXOIF_POSN                  equ 0002h
SPI1INTF_SPI1RXOIF_POSITION              equ 0002h
SPI1INTF_SPI1RXOIF_SIZE                  equ 0001h
SPI1INTF_SPI1RXOIF_LENGTH                equ 0001h
SPI1INTF_SPI1RXOIF_MASK                  equ 0004h
SPI1INTF_SPI1EOSIF_POSN                  equ 0004h
SPI1INTF_SPI1EOSIF_POSITION              equ 0004h
SPI1INTF_SPI1EOSIF_SIZE                  equ 0001h
SPI1INTF_SPI1EOSIF_LENGTH                equ 0001h
SPI1INTF_SPI1EOSIF_MASK                  equ 0010h
SPI1INTF_SPI1SOSIF_POSN                  equ 0005h
SPI1INTF_SPI1SOSIF_POSITION              equ 0005h
SPI1INTF_SPI1SOSIF_SIZE                  equ 0001h
SPI1INTF_SPI1SOSIF_LENGTH                equ 0001h
SPI1INTF_SPI1SOSIF_MASK                  equ 0020h
SPI1INTF_SPI1TCZIF_POSN                  equ 0006h
SPI1INTF_SPI1TCZIF_POSITION              equ 0006h
SPI1INTF_SPI1TCZIF_SIZE                  equ 0001h
SPI1INTF_SPI1TCZIF_LENGTH                equ 0001h
SPI1INTF_SPI1TCZIF_MASK                  equ 0040h
SPI1INTF_SPI1SRMTIF_POSN                 equ 0007h
SPI1INTF_SPI1SRMTIF_POSITION             equ 0007h
SPI1INTF_SPI1SRMTIF_SIZE                 equ 0001h
SPI1INTF_SPI1SRMTIF_LENGTH               equ 0001h
SPI1INTF_SPI1SRMTIF_MASK                 equ 0080h

// Register: SPI1INTE
#define SPI1INTE SPI1INTE
SPI1INTE                                 equ 01E2h
// bitfield definitions
SPI1INTE_TXUIE_POSN                      equ 0001h
SPI1INTE_TXUIE_POSITION                  equ 0001h
SPI1INTE_TXUIE_SIZE                      equ 0001h
SPI1INTE_TXUIE_LENGTH                    equ 0001h
SPI1INTE_TXUIE_MASK                      equ 0002h
SPI1INTE_RXOIE_POSN                      equ 0002h
SPI1INTE_RXOIE_POSITION                  equ 0002h
SPI1INTE_RXOIE_SIZE                      equ 0001h
SPI1INTE_RXOIE_LENGTH                    equ 0001h
SPI1INTE_RXOIE_MASK                      equ 0004h
SPI1INTE_EOSIE_POSN                      equ 0004h
SPI1INTE_EOSIE_POSITION                  equ 0004h
SPI1INTE_EOSIE_SIZE                      equ 0001h
SPI1INTE_EOSIE_LENGTH                    equ 0001h
SPI1INTE_EOSIE_MASK                      equ 0010h
SPI1INTE_SOSIE_POSN                      equ 0005h
SPI1INTE_SOSIE_POSITION                  equ 0005h
SPI1INTE_SOSIE_SIZE                      equ 0001h
SPI1INTE_SOSIE_LENGTH                    equ 0001h
SPI1INTE_SOSIE_MASK                      equ 0020h
SPI1INTE_TCZIE_POSN                      equ 0006h
SPI1INTE_TCZIE_POSITION                  equ 0006h
SPI1INTE_TCZIE_SIZE                      equ 0001h
SPI1INTE_TCZIE_LENGTH                    equ 0001h
SPI1INTE_TCZIE_MASK                      equ 0040h
SPI1INTE_SRMTIE_POSN                     equ 0007h
SPI1INTE_SRMTIE_POSITION                 equ 0007h
SPI1INTE_SRMTIE_SIZE                     equ 0001h
SPI1INTE_SRMTIE_LENGTH                   equ 0001h
SPI1INTE_SRMTIE_MASK                     equ 0080h
SPI1INTE_SPI1TXUIE_POSN                  equ 0001h
SPI1INTE_SPI1TXUIE_POSITION              equ 0001h
SPI1INTE_SPI1TXUIE_SIZE                  equ 0001h
SPI1INTE_SPI1TXUIE_LENGTH                equ 0001h
SPI1INTE_SPI1TXUIE_MASK                  equ 0002h
SPI1INTE_SPI1RXOIE_POSN                  equ 0002h
SPI1INTE_SPI1RXOIE_POSITION              equ 0002h
SPI1INTE_SPI1RXOIE_SIZE                  equ 0001h
SPI1INTE_SPI1RXOIE_LENGTH                equ 0001h
SPI1INTE_SPI1RXOIE_MASK                  equ 0004h
SPI1INTE_SPI1EOSIE_POSN                  equ 0004h
SPI1INTE_SPI1EOSIE_POSITION              equ 0004h
SPI1INTE_SPI1EOSIE_SIZE                  equ 0001h
SPI1INTE_SPI1EOSIE_LENGTH                equ 0001h
SPI1INTE_SPI1EOSIE_MASK                  equ 0010h
SPI1INTE_SPI1SOSIE_POSN                  equ 0005h
SPI1INTE_SPI1SOSIE_POSITION              equ 0005h
SPI1INTE_SPI1SOSIE_SIZE                  equ 0001h
SPI1INTE_SPI1SOSIE_LENGTH                equ 0001h
SPI1INTE_SPI1SOSIE_MASK                  equ 0020h
SPI1INTE_SPI1TCZIE_POSN                  equ 0006h
SPI1INTE_SPI1TCZIE_POSITION              equ 0006h
SPI1INTE_SPI1TCZIE_SIZE                  equ 0001h
SPI1INTE_SPI1TCZIE_LENGTH                equ 0001h
SPI1INTE_SPI1TCZIE_MASK                  equ 0040h
SPI1INTE_SPI1SRMTIE_POSN                 equ 0007h
SPI1INTE_SPI1SRMTIE_POSITION             equ 0007h
SPI1INTE_SPI1SRMTIE_SIZE                 equ 0001h
SPI1INTE_SPI1SRMTIE_LENGTH               equ 0001h
SPI1INTE_SPI1SRMTIE_MASK                 equ 0080h

// Register: SPI1CLK
#define SPI1CLK SPI1CLK
SPI1CLK                                  equ 01E3h
// bitfield definitions
SPI1CLK_CLKSEL_POSN                      equ 0000h
SPI1CLK_CLKSEL_POSITION                  equ 0000h
SPI1CLK_CLKSEL_SIZE                      equ 0008h
SPI1CLK_CLKSEL_LENGTH                    equ 0008h
SPI1CLK_CLKSEL_MASK                      equ 00FFh
SPI1CLK_CLKSEL0_POSN                     equ 0000h
SPI1CLK_CLKSEL0_POSITION                 equ 0000h
SPI1CLK_CLKSEL0_SIZE                     equ 0001h
SPI1CLK_CLKSEL0_LENGTH                   equ 0001h
SPI1CLK_CLKSEL0_MASK                     equ 0001h
SPI1CLK_CLKSEL1_POSN                     equ 0001h
SPI1CLK_CLKSEL1_POSITION                 equ 0001h
SPI1CLK_CLKSEL1_SIZE                     equ 0001h
SPI1CLK_CLKSEL1_LENGTH                   equ 0001h
SPI1CLK_CLKSEL1_MASK                     equ 0002h
SPI1CLK_CLKSEL2_POSN                     equ 0002h
SPI1CLK_CLKSEL2_POSITION                 equ 0002h
SPI1CLK_CLKSEL2_SIZE                     equ 0001h
SPI1CLK_CLKSEL2_LENGTH                   equ 0001h
SPI1CLK_CLKSEL2_MASK                     equ 0004h
SPI1CLK_CLKSEL3_POSN                     equ 0003h
SPI1CLK_CLKSEL3_POSITION                 equ 0003h
SPI1CLK_CLKSEL3_SIZE                     equ 0001h
SPI1CLK_CLKSEL3_LENGTH                   equ 0001h
SPI1CLK_CLKSEL3_MASK                     equ 0008h
SPI1CLK_SPI1CLKSEL_POSN                  equ 0000h
SPI1CLK_SPI1CLKSEL_POSITION              equ 0000h
SPI1CLK_SPI1CLKSEL_SIZE                  equ 0008h
SPI1CLK_SPI1CLKSEL_LENGTH                equ 0008h
SPI1CLK_SPI1CLKSEL_MASK                  equ 00FFh
SPI1CLK_SPI1CLKSEL0_POSN                 equ 0000h
SPI1CLK_SPI1CLKSEL0_POSITION             equ 0000h
SPI1CLK_SPI1CLKSEL0_SIZE                 equ 0001h
SPI1CLK_SPI1CLKSEL0_LENGTH               equ 0001h
SPI1CLK_SPI1CLKSEL0_MASK                 equ 0001h
SPI1CLK_SPI1CLKSEL1_POSN                 equ 0001h
SPI1CLK_SPI1CLKSEL1_POSITION             equ 0001h
SPI1CLK_SPI1CLKSEL1_SIZE                 equ 0001h
SPI1CLK_SPI1CLKSEL1_LENGTH               equ 0001h
SPI1CLK_SPI1CLKSEL1_MASK                 equ 0002h
SPI1CLK_SPI1CLKSEL2_POSN                 equ 0002h
SPI1CLK_SPI1CLKSEL2_POSITION             equ 0002h
SPI1CLK_SPI1CLKSEL2_SIZE                 equ 0001h
SPI1CLK_SPI1CLKSEL2_LENGTH               equ 0001h
SPI1CLK_SPI1CLKSEL2_MASK                 equ 0004h
SPI1CLK_SPI1CLKSEL3_POSN                 equ 0003h
SPI1CLK_SPI1CLKSEL3_POSITION             equ 0003h
SPI1CLK_SPI1CLKSEL3_SIZE                 equ 0001h
SPI1CLK_SPI1CLKSEL3_LENGTH               equ 0001h
SPI1CLK_SPI1CLKSEL3_MASK                 equ 0008h

// Register: I2C1STAT0
#define I2C1STAT0 I2C1STAT0
I2C1STAT0                                equ 01E4h
// bitfield definitions
I2C1STAT0_D_POSN                         equ 0003h
I2C1STAT0_D_POSITION                     equ 0003h
I2C1STAT0_D_SIZE                         equ 0001h
I2C1STAT0_D_LENGTH                       equ 0001h
I2C1STAT0_D_MASK                         equ 0008h
I2C1STAT0_R_POSN                         equ 0004h
I2C1STAT0_R_POSITION                     equ 0004h
I2C1STAT0_R_SIZE                         equ 0001h
I2C1STAT0_R_LENGTH                       equ 0001h
I2C1STAT0_R_MASK                         equ 0010h
I2C1STAT0_MMA_POSN                       equ 0005h
I2C1STAT0_MMA_POSITION                   equ 0005h
I2C1STAT0_MMA_SIZE                       equ 0001h
I2C1STAT0_MMA_LENGTH                     equ 0001h
I2C1STAT0_MMA_MASK                       equ 0020h
I2C1STAT0_SMA_POSN                       equ 0006h
I2C1STAT0_SMA_POSITION                   equ 0006h
I2C1STAT0_SMA_SIZE                       equ 0001h
I2C1STAT0_SMA_LENGTH                     equ 0001h
I2C1STAT0_SMA_MASK                       equ 0040h
I2C1STAT0_BFRE_POSN                      equ 0007h
I2C1STAT0_BFRE_POSITION                  equ 0007h
I2C1STAT0_BFRE_SIZE                      equ 0001h
I2C1STAT0_BFRE_LENGTH                    equ 0001h
I2C1STAT0_BFRE_MASK                      equ 0080h
I2C1STAT0_DATA_POSN                      equ 0003h
I2C1STAT0_DATA_POSITION                  equ 0003h
I2C1STAT0_DATA_SIZE                      equ 0001h
I2C1STAT0_DATA_LENGTH                    equ 0001h
I2C1STAT0_DATA_MASK                      equ 0008h
I2C1STAT0_READ_POSN                      equ 0004h
I2C1STAT0_READ_POSITION                  equ 0004h
I2C1STAT0_READ_SIZE                      equ 0001h
I2C1STAT0_READ_LENGTH                    equ 0001h
I2C1STAT0_READ_MASK                      equ 0010h
I2C1STAT0_NOT_ADDRESS_POSN               equ 0003h
I2C1STAT0_NOT_ADDRESS_POSITION           equ 0003h
I2C1STAT0_NOT_ADDRESS_SIZE               equ 0001h
I2C1STAT0_NOT_ADDRESS_LENGTH             equ 0001h
I2C1STAT0_NOT_ADDRESS_MASK               equ 0008h
I2C1STAT0_NOT_WRITE_POSN                 equ 0004h
I2C1STAT0_NOT_WRITE_POSITION             equ 0004h
I2C1STAT0_NOT_WRITE_SIZE                 equ 0001h
I2C1STAT0_NOT_WRITE_LENGTH               equ 0001h
I2C1STAT0_NOT_WRITE_MASK                 equ 0010h
I2C1STAT0_NOT_A_POSN                     equ 0003h
I2C1STAT0_NOT_A_POSITION                 equ 0003h
I2C1STAT0_NOT_A_SIZE                     equ 0001h
I2C1STAT0_NOT_A_LENGTH                   equ 0001h
I2C1STAT0_NOT_A_MASK                     equ 0008h
I2C1STAT0_NOT_W_POSN                     equ 0004h
I2C1STAT0_NOT_W_POSITION                 equ 0004h
I2C1STAT0_NOT_W_SIZE                     equ 0001h
I2C1STAT0_NOT_W_LENGTH                   equ 0001h
I2C1STAT0_NOT_W_MASK                     equ 0010h

