garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f14q20.inc
// Register: INTCON1
#define INTCON1 INTCON1
INTCON1                                  equ 0462h
// bitfield definitions
INTCON1_STAT_POSN                        equ 0006h
INTCON1_STAT_POSITION                    equ 0006h
INTCON1_STAT_SIZE                        equ 0002h
INTCON1_STAT_LENGTH                      equ 0002h
INTCON1_STAT_MASK                        equ 00C0h
INTCON1_STAT0_POSN                       equ 0006h
INTCON1_STAT0_POSITION                   equ 0006h
INTCON1_STAT0_SIZE                       equ 0001h
INTCON1_STAT0_LENGTH                     equ 0001h
INTCON1_STAT0_MASK                       equ 0040h
INTCON1_STAT1_POSN                       equ 0007h
INTCON1_STAT1_POSITION                   equ 0007h
INTCON1_STAT1_SIZE                       equ 0001h
INTCON1_STAT1_LENGTH                     equ 0001h
INTCON1_STAT1_MASK                       equ 0080h

// Register: IVTAD
#define IVTAD IVTAD
IVTAD                                    equ 0463h

// Register: IVTADL
#define IVTADL IVTADL
IVTADL                                   equ 0463h
// bitfield definitions
IVTADL_IVTADL_POSN                       equ 0000h
IVTADL_IVTADL_POSITION                   equ 0000h
IVTADL_IVTADL_SIZE                       equ 0008h
IVTADL_IVTADL_LENGTH                     equ 0008h
IVTADL_IVTADL_MASK                       equ 00FFh

// Register: IVTADH
#define IVTADH IVTADH
IVTADH                                   equ 0464h
// bitfield definitions
IVTADH_IVTADH_POSN                       equ 0000h
IVTADH_IVTADH_POSITION                   equ 0000h
IVTADH_IVTADH_SIZE                       equ 0008h
IVTADH_IVTADH_LENGTH                     equ 0008h
IVTADH_IVTADH_MASK                       equ 00FFh

// Register: IVTADU
#define IVTADU IVTADU
IVTADU                                   equ 0465h
// bitfield definitions
IVTADU_IVTADU_POSN                       equ 0000h
IVTADU_IVTADU_POSITION                   equ 0000h
IVTADU_IVTADU_SIZE                       equ 0005h
IVTADU_IVTADU_LENGTH                     equ 0005h
IVTADU_IVTADU_MASK                       equ 001Fh

// Register: IVTBASE
#define IVTBASE IVTBASE
IVTBASE                                  equ 0466h

// Register: IVTBASEL
#define IVTBASEL IVTBASEL
IVTBASEL                                 equ 0466h
// bitfield definitions
IVTBASEL_IVTBASEL_POSN                   equ 0000h
IVTBASEL_IVTBASEL_POSITION               equ 0000h
IVTBASEL_IVTBASEL_SIZE                   equ 0008h
IVTBASEL_IVTBASEL_LENGTH                 equ 0008h
IVTBASEL_IVTBASEL_MASK                   equ 00FFh

// Register: IVTBASEH
#define IVTBASEH IVTBASEH
IVTBASEH                                 equ 0467h
// bitfield definitions
IVTBASEH_IVTBASEH_POSN                   equ 0000h
IVTBASEH_IVTBASEH_POSITION               equ 0000h
IVTBASEH_IVTBASEH_SIZE                   equ 0008h
IVTBASEH_IVTBASEH_LENGTH                 equ 0008h
IVTBASEH_IVTBASEH_MASK                   equ 00FFh

// Register: IVTBASEU
#define IVTBASEU IVTBASEU
IVTBASEU                                 equ 0468h
// bitfield definitions
IVTBASEU_IVTBASEU_POSN                   equ 0000h
IVTBASEU_IVTBASEU_POSITION               equ 0000h
IVTBASEU_IVTBASEU_SIZE                   equ 0005h
IVTBASEU_IVTBASEU_LENGTH                 equ 0005h
IVTBASEU_IVTBASEU_MASK                   equ 001Fh

// Register: PIR0
#define PIR0 PIR0
PIR0                                     equ 0469h
// bitfield definitions
PIR0_SWIF_POSN                           equ 0000h
PIR0_SWIF_POSITION                       equ 0000h
PIR0_SWIF_SIZE                           equ 0001h
PIR0_SWIF_LENGTH                         equ 0001h
PIR0_SWIF_MASK                           equ 0001h
PIR0_INT0IF_POSN                         equ 0001h
PIR0_INT0IF_POSITION                     equ 0001h
PIR0_INT0IF_SIZE                         equ 0001h
PIR0_INT0IF_LENGTH                       equ 0001h
PIR0_INT0IF_MASK                         equ 0002h
PIR0_INT1IF_POSN                         equ 0002h
PIR0_INT1IF_POSITION                     equ 0002h
PIR0_INT1IF_SIZE                         equ 0001h
PIR0_INT1IF_LENGTH                       equ 0001h
PIR0_INT1IF_MASK                         equ 0004h
PIR0_INT2IF_POSN                         equ 0003h
PIR0_INT2IF_POSITION                     equ 0003h
PIR0_INT2IF_SIZE                         equ 0001h
PIR0_INT2IF_LENGTH                       equ 0001h
PIR0_INT2IF_MASK                         equ 0008h
PIR0_DMA1SCNTIF_POSN                     equ 0004h
PIR0_DMA1SCNTIF_POSITION                 equ 0004h
PIR0_DMA1SCNTIF_SIZE                     equ 0001h
PIR0_DMA1SCNTIF_LENGTH                   equ 0001h
PIR0_DMA1SCNTIF_MASK                     equ 0010h
PIR0_DMA1DCNTIF_POSN                     equ 0005h
PIR0_DMA1DCNTIF_POSITION                 equ 0005h
PIR0_DMA1DCNTIF_SIZE                     equ 0001h
PIR0_DMA1DCNTIF_LENGTH                   equ 0001h
PIR0_DMA1DCNTIF_MASK                     equ 0020h
PIR0_DMA1ORIF_POSN                       equ 0006h
PIR0_DMA1ORIF_POSITION                   equ 0006h
PIR0_DMA1ORIF_SIZE                       equ 0001h
PIR0_DMA1ORIF_LENGTH                     equ 0001h
PIR0_DMA1ORIF_MASK                       equ 0040h
PIR0_DMA1AIF_POSN                        equ 0007h
PIR0_DMA1AIF_POSITION                    equ 0007h
PIR0_DMA1AIF_SIZE                        equ 0001h
PIR0_DMA1AIF_LENGTH                      equ 0001h
PIR0_DMA1AIF_MASK                        equ 0080h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 046Ah
// bitfield definitions
PIR1_DMA2SCNTIF_POSN                     equ 0000h
PIR1_DMA2SCNTIF_POSITION                 equ 0000h
PIR1_DMA2SCNTIF_SIZE                     equ 0001h
PIR1_DMA2SCNTIF_LENGTH                   equ 0001h
PIR1_DMA2SCNTIF_MASK                     equ 0001h
PIR1_DMA2DCNTIF_POSN                     equ 0001h
PIR1_DMA2DCNTIF_POSITION                 equ 0001h
PIR1_DMA2DCNTIF_SIZE                     equ 0001h
PIR1_DMA2DCNTIF_LENGTH                   equ 0001h
PIR1_DMA2DCNTIF_MASK                     equ 0002h
PIR1_DMA2ORIF_POSN                       equ 0002h
PIR1_DMA2ORIF_POSITION                   equ 0002h
PIR1_DMA2ORIF_SIZE                       equ 0001h
PIR1_DMA2ORIF_LENGTH                     equ 0001h
PIR1_DMA2ORIF_MASK                       equ 0004h
PIR1_DMA2AIF_POSN                        equ 0003h
PIR1_DMA2AIF_POSITION                    equ 0003h
PIR1_DMA2AIF_SIZE                        equ 0001h
PIR1_DMA2AIF_LENGTH                      equ 0001h
PIR1_DMA2AIF_MASK                        equ 0008h
PIR1_DMA3SCNTIF_POSN                     equ 0004h
PIR1_DMA3SCNTIF_POSITION                 equ 0004h
PIR1_DMA3SCNTIF_SIZE                     equ 0001h
PIR1_DMA3SCNTIF_LENGTH                   equ 0001h
PIR1_DMA3SCNTIF_MASK                     equ 0010h
PIR1_DMA3DCNTIF_POSN                     equ 0005h
PIR1_DMA3DCNTIF_POSITION                 equ 0005h
PIR1_DMA3DCNTIF_SIZE                     equ 0001h
PIR1_DMA3DCNTIF_LENGTH                   equ 0001h
PIR1_DMA3DCNTIF_MASK                     equ 0020h
PIR1_DMA3ORIF_POSN                       equ 0006h
PIR1_DMA3ORIF_POSITION                   equ 0006h
PIR1_DMA3ORIF_SIZE                       equ 0001h
PIR1_DMA3ORIF_LENGTH                     equ 0001h
PIR1_DMA3ORIF_MASK                       equ 0040h
PIR1_DMA3AIF_POSN                        equ 0007h
PIR1_DMA3AIF_POSITION                    equ 0007h
PIR1_DMA3AIF_SIZE                        equ 0001h
PIR1_DMA3AIF_LENGTH                      equ 0001h
PIR1_DMA3AIF_MASK                        equ 0080h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 046Bh
// bitfield definitions
PIR2_DMA4SCNTIF_POSN                     equ 0000h
PIR2_DMA4SCNTIF_POSITION                 equ 0000h
PIR2_DMA4SCNTIF_SIZE                     equ 0001h
PIR2_DMA4SCNTIF_LENGTH                   equ 0001h
PIR2_DMA4SCNTIF_MASK                     equ 0001h
PIR2_DMA4DCNTIF_POSN                     equ 0001h
PIR2_DMA4DCNTIF_POSITION                 equ 0001h
PIR2_DMA4DCNTIF_SIZE                     equ 0001h
PIR2_DMA4DCNTIF_LENGTH                   equ 0001h
PIR2_DMA4DCNTIF_MASK                     equ 0002h
PIR2_DMA4ORIF_POSN                       equ 0002h
PIR2_DMA4ORIF_POSITION                   equ 0002h
PIR2_DMA4ORIF_SIZE                       equ 0001h
PIR2_DMA4ORIF_LENGTH                     equ 0001h
PIR2_DMA4ORIF_MASK                       equ 0004h
PIR2_DMA4AIF_POSN                        equ 0003h
PIR2_DMA4AIF_POSITION                    equ 0003h
PIR2_DMA4AIF_SIZE                        equ 0001h
PIR2_DMA4AIF_LENGTH                      equ 0001h
PIR2_DMA4AIF_MASK                        equ 0008h
PIR2_NVMIF_POSN                          equ 0004h
PIR2_NVMIF_POSITION                      equ 0004h
PIR2_NVMIF_SIZE                          equ 0001h
PIR2_NVMIF_LENGTH                        equ 0001h
PIR2_NVMIF_MASK                          equ 0010h
PIR2_CRCIF_POSN                          equ 0005h
PIR2_CRCIF_POSITION                      equ 0005h
PIR2_CRCIF_SIZE                          equ 0001h
PIR2_CRCIF_LENGTH                        equ 0001h
PIR2_CRCIF_MASK                          equ 0020h
PIR2_SCANIF_POSN                         equ 0006h
PIR2_SCANIF_POSITION                     equ 0006h
PIR2_SCANIF_SIZE                         equ 0001h
PIR2_SCANIF_LENGTH                       equ 0001h
PIR2_SCANIF_MASK                         equ 0040h
PIR2_ACTIF_POSN                          equ 0007h
PIR2_ACTIF_POSITION                      equ 0007h
PIR2_ACTIF_SIZE                          equ 0001h
PIR2_ACTIF_LENGTH                        equ 0001h
PIR2_ACTIF_MASK                          equ 0080h

// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 046Ch
// bitfield definitions
PIR3_CSWIF_POSN                          equ 0000h
PIR3_CSWIF_POSITION                      equ 0000h
PIR3_CSWIF_SIZE                          equ 0001h
PIR3_CSWIF_LENGTH                        equ 0001h
PIR3_CSWIF_MASK                          equ 0001h
PIR3_OSFIF_POSN                          equ 0001h
PIR3_OSFIF_POSITION                      equ 0001h
PIR3_OSFIF_SIZE                          equ 0001h
PIR3_OSFIF_LENGTH                        equ 0001h
PIR3_OSFIF_MASK                          equ 0002h
PIR3_VDDIO2IF_POSN                       equ 0002h
PIR3_VDDIO2IF_POSITION                   equ 0002h
PIR3_VDDIO2IF_SIZE                       equ 0001h
PIR3_VDDIO2IF_LENGTH                     equ 0001h
PIR3_VDDIO2IF_MASK                       equ 0004h
PIR3_VDDIO3IF_POSN                       equ 0003h
PIR3_VDDIO3IF_POSITION                   equ 0003h
PIR3_VDDIO3IF_SIZE                       equ 0001h
PIR3_VDDIO3IF_LENGTH                     equ 0001h
PIR3_VDDIO3IF_MASK                       equ 0008h
PIR3_IOCIF_POSN                          equ 0004h
PIR3_IOCIF_POSITION                      equ 0004h
PIR3_IOCIF_SIZE                          equ 0001h
PIR3_IOCIF_LENGTH                        equ 0001h
PIR3_IOCIF_MASK                          equ 0010h
PIR3_TMR0IF_POSN                         equ 0005h
PIR3_TMR0IF_POSITION                     equ 0005h
PIR3_TMR0IF_SIZE                         equ 0001h
PIR3_TMR0IF_LENGTH                       equ 0001h
PIR3_TMR0IF_MASK                         equ 0020h
PIR3_TMR1IF_POSN                         equ 0006h
PIR3_TMR1IF_POSITION                     equ 0006h
PIR3_TMR1IF_SIZE                         equ 0001h
PIR3_TMR1IF_LENGTH                       equ 0001h
PIR3_TMR1IF_MASK                         equ 0040h
PIR3_TMR1GIF_POSN                        equ 0007h
PIR3_TMR1GIF_POSITION                    equ 0007h
PIR3_TMR1GIF_SIZE                        equ 0001h
PIR3_TMR1GIF_LENGTH                      equ 0001h
PIR3_TMR1GIF_MASK                        equ 0080h

// Register: PIR4
#define PIR4 PIR4
PIR4                                     equ 046Dh
// bitfield definitions
PIR4_TMR2IF_POSN                         equ 0000h
PIR4_TMR2IF_POSITION                     equ 0000h
PIR4_TMR2IF_SIZE                         equ 0001h
PIR4_TMR2IF_LENGTH                       equ 0001h
PIR4_TMR2IF_MASK                         equ 0001h
PIR4_TMR4IF_POSN                         equ 0001h
PIR4_TMR4IF_POSITION                     equ 0001h
PIR4_TMR4IF_SIZE                         equ 0001h
PIR4_TMR4IF_LENGTH                       equ 0001h
PIR4_TMR4IF_MASK                         equ 0002h
PIR4_TU16AIF_POSN                        equ 0002h
PIR4_TU16AIF_POSITION                    equ 0002h
PIR4_TU16AIF_SIZE                        equ 0001h
PIR4_TU16AIF_LENGTH                      equ 0001h
PIR4_TU16AIF_MASK                        equ 0004h
PIR4_TU16BIF_POSN                        equ 0003h
PIR4_TU16BIF_POSITION                    equ 0003h
PIR4_TU16BIF_SIZE                        equ 0001h
PIR4_TU16BIF_LENGTH                      equ 0001h
PIR4_TU16BIF_MASK                        equ 0008h
PIR4_CCP1IF_POSN                         equ 0004h
PIR4_CCP1IF_POSITION                     equ 0004h
PIR4_CCP1IF_SIZE                         equ 0001h
PIR4_CCP1IF_LENGTH                       equ 0001h
PIR4_CCP1IF_MASK                         equ 0010h
PIR4_CCP2IF_POSN                         equ 0005h
PIR4_CCP2IF_POSITION                     equ 0005h
PIR4_CCP2IF_SIZE                         equ 0001h
PIR4_CCP2IF_LENGTH                       equ 0001h
PIR4_CCP2IF_MASK                         equ 0020h
PIR4_PWM1PIF_POSN                        equ 0006h
PIR4_PWM1PIF_POSITION                    equ 0006h
PIR4_PWM1PIF_SIZE                        equ 0001h
PIR4_PWM1PIF_LENGTH                      equ 0001h
PIR4_PWM1PIF_MASK                        equ 0040h
PIR4_PWM1IF_POSN                         equ 0007h
PIR4_PWM1IF_POSITION                     equ 0007h
PIR4_PWM1IF_SIZE                         equ 0001h
PIR4_PWM1IF_LENGTH                       equ 0001h
PIR4_PWM1IF_MASK                         equ 0080h

